tsung/critical.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <!-- Instance name must be links-in-dev -->
  <servers>
    <server host="linksin-dev.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <!-- 
      Phase 1: 1 user every second
      Duration: 60 seconds
     -->
    <arrivalphase phase="1" duration="60" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <!-- 
      Phase 2: 1 user every 2 seconds
      Duration: 60 seconds
     -->
    <arrivalphase phase="2" duration="60" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <!-- 
      Phase 3: 1 user every 4 seconds
      Duration: 60 seconds
     -->
    <arrivalphase phase="3" duration="60" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <!-- 
    A user will perform the following series of requests
   -->
  <sessions>
    <session name="http-example" probability="100" type="ts_http">

      <!-- Start out at the home page -->
      <request>
        <http url='/' version='1.1' method='GET'>
          <http_header name='Accept-Encoding' value='gzip, deflate' />
        </http>
      </request>
      
      <!-- wait for up to 10 seconds, user is looking at homepage -->
      <thinktime value="10" random="true"></thinktime>

      <!--  user decides to sign up for our service -->
      <request subst="true">
        <dyn_variable name="authenticity_token"></dyn_variable>
        <http url="/signup" method="GET" version="1.1">
          <http_header name='Accept-Encoding' value='gzip, deflate' />
        </http>
      </request>

      <!-- user is looking at sign up form for up to 2 seconds -->
      <thinktime value="2" random="true"></thinktime>
      
      <!-- user creates a username/email -->
      <setdynvars sourcetype="random_string" length="6">
        <var name="rndstring" />
      </setdynvars>

      <!-- encode authenticity_token -->
      <setdynvars 
        sourcetype="eval"
        code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),http_uri:encode(Val) end."
      >
        <var name="encoded_authenticity_token" />
      </setdynvars>

      <!-- User signup -->
      <request subst="true">
        <http 
          url="/signup" 
          method="POST" 
          version="1.1" 
          contents="authenticity_token=%%_encoded_authenticity_token%%&amp;user[name]=%%_rndstring%%&amp;user[email]=%%_rndstring%%@gmail.com&amp;user[password]=linksin&amp;user[password_confirmation]=linksin&amp;commit=Create+Account"
          content_type="application/x-www-form-urlencoded"
        >
          <http_header name='Accept-Encoding' value='gzip, deflate' />
        </http>
      </request>

      <!-- User is waiting to be logged in -->
      <thinktime random="true" min="5" max="10" />

      <!-- User is redirected to user home page -->
      <request>
        <http url='/' version='1.1' method='GET'>
          <http_header name='Accept-Encoding' value='gzip, deflate' />
        </http>
      </request>

      <!-- User thinks about what to do -->
      <thinktime random="true" value="2" />

      <!-- User goes to Events page -->
      <request>
        <dyn_variable name="authenticity_token"></dyn_variable>
        <http url='/events' version='1.1' method='GET'>
          <http_header name='Accept-Encoding' value='gzip, deflate' />
        </http>
      </request>

      <!-- User is looking at the event creation form -->
      <thinktime random="true" value="2" />

      <!-- user creates a username/email -->
      <setdynvars sourcetype="random_string" length="6">
        <var name="rndevent" />
      </setdynvars>

      <!-- encode authenticity_token -->
      <setdynvars 
        sourcetype="eval"
        code="fun({Pid,DynVars})->{ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),http_uri:encode(Val) end."
      >
        <var name="encoded_event_authenticity_token" />
      </setdynvars>

      <!-- User creats an event -->
      <request subst="true">
        <http 
          url="/events" 
          method="POST" 
          version="1.1" 
          contents="authenticity_token=%%_encoded_event_authenticity_token%%&amp;event[name]=%%_rndevent%%&amp;event[date]=2020-12-20&amp;event[time]=08%3A05&amp;event[description]=%%_rndevent%%&amp;commit=Create+Account"
          content_type="application/x-www-form-urlencoded" 
        >
          <http_header name='Accept-Encoding' value='gzip, deflate' />
        </http>
      </request>

      <!-- User goes to user home page -->
      <request>
        <http url='/' version='1.1' method='GET'>
          <http_header name='Accept-Encoding' value='gzip, deflate' />
        </http>
      </request>

      <!-- User matches with some gamers -->

      <!-- User goes to matches page to checkout new matches -->

      <!-- User goes to conversations page to chat with gamers -->

      <!-- User sends a message to one of the gamers -->

      <!-- User log out -->

    </session>
  </sessions>
</tsung>