tsung/messages.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >


<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="links-in-dev.vg3uaunike.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <arrivalphase phase="1" duration="1" unit="minute">
      <users arrivalrate="1" unit="second" maxnumber="9"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>

    <option name="file_server" id="userlist" value="userlist.csv"></option>
  </options>

  <sessions>
    <session name='dynamic_signup_test' probability='100' type='ts_http'>
      <!-- sets dynamic variables from csv list with id userlist -->
      <setdynvars sourcetype="file" fileid="userlist" delimiter=";" order="iter">
          <var name="user_name" />
          <var name="user_email" />
      </setdynvars>

      <!-- request homepage -->
      <request subst="true">
            <http url="/" method="GET" version="1.1" />
      </request>

      <!-- user checks out sick homepage animations -->
      <thinktime random="true" min="2" max="5"/>

      <!-- get the signup page -->
      <request subst="true">
          <dyn_variable name="authenticity_token"></dyn_variable>
          <http url="/signup" method="GET" version="1.1" />
      </request>

      <!-- fill out the form -->
      <thinktime random="true" min="2" max="8"/>

      <!-- parse dynamic variables to url-encoded variables -->
      <setdynvars sourcetype="eval"
              code="fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(user_name,DynVars),
                        http_uri:encode(Val) end.">
          <var name="encoded_user_name" />
      </setdynvars>
      <setdynvars sourcetype="eval"
              code="fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(user_email,DynVars),
                        http_uri:encode(Val) end.">
          <var name="encoded_user_email" />
      </setdynvars>

      <!-- sign up with password as meow123 -->
      <request subst="true">
          <http url="/signup" method="POST" version="1.1" contents="user[name]=%%encoded_user_name%%&amp;user[email]=%%encoded_user_email%%m&amp;user[password]=meow123&amp;user[password_confirmation]=meow123&amp;commit=Create Account" content_type="application/x-www-form-urlencoded" />
      </request>

      <!-- admire -->
      <thinktime random="true" min="2" max="4"/>

      <!-- give yourself a profile description -->
    </session>
  </sessions>

</tsung>