tsung/signup.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="linksin-dev.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>


  <load>
    <!-- 
               Phase 1: 1 user every second
      Duration: 60 seconds
     -->
    <arrivalphase phase="1" duration="60" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <!-- 
               Phase 2: 1 user every 2 seconds
      Duration: 60 seconds
     -->
    <arrivalphase phase="2" duration="60" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <!-- 
               Phase 3: 1 user every 4 seconds
      Duration: 60 seconds
     -->
    <arrivalphase phase="3" duration="60" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>

    <option name="file_server" id="userlist" value="userlist.csv"></option>
  </options>

  <sessions>
    <session name='crit_path_test' probability='100' type='ts_http'>
      <!-- sets dynamic variables from csv list with id userlist -->
      <setdynvars sourcetype="file" fileid="userlist" delimiter=";" order="iter">
          <var name="user_id" />
          <var name="user_name" />
          <var name="user_email" />
      </setdynvars>

       <!-- Start out at the home page -->
      <request>
        <http url='/' version='1.1' method='GET'>
          <http_header name='Accept-Encoding' value='gzip, deflate' />
        </http>
      </request>
      
      <!-- wait for up to 10 seconds, user is looking at homepage -->
      <thinktime value="10" random="true"></thinktime>

      <!--  user decides to sign up for our service -->
      <request subst="true">
        <dyn_variable name="authenticity_token"></dyn_variable>
        <http url="/signup" method="GET" version="1.1">
          <http_header name='Accept-Encoding' value='gzip, deflate' />
        </http>
      </request>

      <!-- user is filling out signup form -->
      <thinktime random="true" min="5" max="10" />

      <!-- parse dynamic variables to url-encoded variables -->
      <setdynvars sourcetype="eval"
              code="fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(authenticity_token,DynVars),
                        http_uri:encode(Val) end.">
          <var name="encoded_authenticity_token" />
      </setdynvars>
      <setdynvars sourcetype="eval"
              code="fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(user_name,DynVars),
                        http_uri:encode(Val) end.">
          <var name="encoded_user_name" />
      </setdynvars>
      <setdynvars sourcetype="eval"
              code="fun({Pid,DynVars})->
                        {ok,Val}=ts_dynvars:lookup(user_email,DynVars),
                        http_uri:encode(Val) end.">
          <var name="encoded_user_email" />
      </setdynvars>

      <!-- sign up with password as meow123 -->
      <request subst="true">
        <dyn_variable name="redirect" re="Location: (http://.*)/edit\r"/>
        <http url="/signup" method="POST" version="1.1" contents="authenticity_token=%%_encoded_authenticity_token%%&amp;
                                                                  user%5Bname%5D=%%_encoded_user_name%%&amp;
                                                                  user%5Bemail%5D=%%_encoded_user_email%%&amp;
                                                                  user%5Bpassword%5D=meow123&amp;
                                                                  user%5Bpassword_confirmation%5D=meow123&amp;
                                                                  commit=Create+Account" content_type="application/x-www-form-urlencoded" >
          
          <http_header name='Accept-Encoding' value='gzip, deflate' />
        </http>
      </request>
    </session>
  </sessions>
</tsung>